In [7]:
import pandas as pd

In [2]:
# Create DataFrame Empty
dataFrame = pd.DataFrame()
print(dataFrame)

Empty DataFrame
Columns: []
Index: []

In [2]:
# Create a dataset
dataSet = [1,2,3,4,5,6]
print(dataSet)

[1, 2, 3, 4, 5, 6]

In [10]:
# Populate the DataFrame
dataFrame = pd.DataFrame(dataSet)
print(dataFrame)  
dataFrame   # To get well defined column

   0
0  1
1  2
2  3
3  4
4  5
5  6

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [9]:
newData = pd.Series([1,2,3,4])
newData

0    1
1    2
2    3
3    4
dtype: int64

In [11]:
# List of List 

listOfList = [[1,2,3,4],[4,5,6,7],[7,8,9,10]]
listOfList

[[1, 2, 3, 4], [4, 5, 6, 7], [7, 8, 9, 10]]

In [12]:
# List of List + DataFrame
dataFrame_listoflist = pd.DataFrame(listOfList)
dataFrame_listoflist

   0  1  2   3
0  1  2  3   4
1  4  5  6   7
2  7  8  9  10

In [16]:
# List of Dictionary 
dictionary_list = {'Name':["Ray","Sky","Alex","Anton"],
                    'Age':[20,21,23,34],
                    'Language':["Python","C","JAVA","JS"]}
dictionary_list

{'Name': ['Ray', 'Sky', 'Alex', 'Anton'],
 'Age': [20, 21, 23, 34],
 'Language': ['Python', 'C', 'JAVA', 'JS']}

In [17]:
# List of Dictionary + Dataframa

dict_Df = pd.DataFrame(dictionary_list)
dict_Df

    Name  Age Language
0    Ray   20   Python
1    Sky   21        C
2   Alex   23     JAVA
3  Anton   34       JS

In [18]:
# Dataframe + Series merge

newSeries = {"ID":pd.Series([21,22,23,24]),
             "Name":pd.Series(["Raj","Flames","Sky","Nick"])}
newSeries

{'ID': 0    21
 1    22
 2    23
 3    24
 dtype: int64,
 'Name': 0       Raj
 1    Flames
 2       Sky
 3      Nick
 dtype: object}

In [19]:
newDataFrame = pd.DataFrame(newSeries)
newDataFrame

   ID    Name
0  21     Raj
1  22  Flames
2  23     Sky
3  24    Nick